module.exports = {
    // The default GET request.
    'POST /mock/upload': {
        "code": 200,
        "msg": "成功",
        "data": "/img.jpeg"
    },

    'POST /mock/addTeacher': {
        "code": 200,
        "msg": "成功",
        "data": null
    },
    
    'POST /mock/editTeacher': {
        "code": 200,
        "msg": "成功",
        "data": null
    },

    'POST /mock/deleteTeacher': {
        "code": 200,
        "msg": "删除成功",
        "data": null
    },

    '/mock/listTeacher': {
        "code": 200,
        "msg": "成功",
        "data": [
            {
                id: "1",
                name: "马某人",
                img: "/img.jpeg",
                mobile: "13856780123",
                role: "1",
                about: "马老师果然不负责任，他一上课就宣布自己教不好学生，无法提高学生的语文成绩，还说要想学好语文还要靠我们学生自己。我心里暗笑他无能：不靠你我们大老远跑来干吗？要是老师不教都能学好，家长们还不把我们扔去牛屁股后面。",
                createTime: "2021-02-26 17:23:43"
            },
            {
                id: "2",
                name: "马某人",
                img: "/img.jpeg",
                mobile: "13856780123",
                role: "1",
                about: "马老师果然不负责任，他一上课就宣布自己教不好学生，无法提高学生的语文成绩，还说要想学好语文还要靠我们学生自己。我心里暗笑他无能：不靠你我们大老远跑来干吗？要是老师不教都能学好，家长们还不把我们扔去牛屁股后面。",
                createTime: "2021-02-26 17:23:43"
            },
            {
                id: "3",
                name: "马某人",
                img: "/img.jpeg",
                mobile: "13856780123",
                role: "1",
                about: "马老师果然不负责任，他一上课就宣布自己教不好学生，无法提高学生的语文成绩，还说要想学好语文还要靠我们学生自己。我心里暗笑他无能：不靠你我们大老远跑来干吗？要是老师不教都能学好，家长们还不把我们扔去牛屁股后面。",
                createTime: "2021-02-26 17:23:43"
            },
            {
                id: "4",
                name: "马某人",
                img: "/img.jpeg",
                mobile: "13856780123",
                role: "1",
                about: "马老师果然不负责任，他一上课就宣布自己教不好学生，无法提高学生的语文成绩，还说要想学好语文还要靠我们学生自己。我心里暗笑他无能：不靠你我们大老远跑来干吗？要是老师不教都能学好，家长们还不把我们扔去牛屁股后面。",
                createTime: "2021-02-26 17:23:43"
            },
            {
                id: "5",
                name: "马某人",
                img: "/img.jpeg",
                mobile: "13856780123",
                role: "1",
                about: "马老师果然不负责任，他一上课就宣布自己教不好学生，无法提高学生的语文成绩，还说要想学好语文还要靠我们学生自己。我心里暗笑他无能：不靠你我们大老远跑来干吗？要是老师不教都能学好，家长们还不把我们扔去牛屁股后面。",
                createTime: "2021-02-26 17:23:43"
            }
        ],
        total: 88
    },
}